WHU-EIS-Robotics/MSPM0-DevKit/UART/Driver/ti/driverlib/dl_i2c.h
    return (DL_I2C_CONTROLLER_PEC_STATUS)(status);
}

/**
 *  @brief      Get the status of the controller SMBus/PMBus PEC Check error
 *
 *  The status of if a PEC check error occurred in the transaction that
 *  occurred before the last Stop. Latched on Stop.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     Status of controller PEC check error
 *
 *  @retval     One of @ref DL_I2C_CONTROLLER_PEC_CHECK_ERROR
 */
__STATIC_INLINE DL_I2C_CONTROLLER_PEC_CHECK_ERROR
DL_I2C_getControllerPECCheckError(I2C_Regs *i2c)
{
    uint32_t error =
        i2c->MASTER.MASTER_PECSR & I2C_MASTER_PECSR_PECSTS_ERROR_MASK;

    return (DL_I2C_CONTROLLER_PEC_CHECK_ERROR)(error);
}

/**
 *  @brief      Disable I2C controller burst mode
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableControllerBurst(I2C_Regs *i2c)
{
    i2c->MASTER.MCTR &= ~(I2C_MCTR_BURSTRUN_MASK);
}

/**
 *  @brief      Checks if I2C controller burst mode is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If I2C controller burst mode is enabled
 *
 *  @retval     true if I2C controller burst mode is enabled
 *  @retval     false if I2C controller burst mode is disabled
 */
__STATIC_INLINE bool DL_I2C_isControllerBurstEnabled(I2C_Regs *i2c)
{
    return ((i2c->GFCTL & I2C_MCTR_BURSTRUN_MASK) == I2C_MCTR_BURSTRUN_ENABLE);
}

/**
 *  @brief      Enable I2C controller burst mode
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableControllerBurst(I2C_Regs *i2c)
{
    i2c->MASTER.MCTR |= I2C_MCTR_BURSTRUN_ENABLE;
}

/**
 *  @brief      Disable I2C START generation
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableStartCondition(I2C_Regs *i2c)
{
    i2c->MASTER.MCTR &= ~(I2C_MCTR_START_MASK);
}

/**
 *  @brief      Checks if I2C START generation is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If I2C START generation is enabled
 *
 *  @retval     true if I2C START generation is enabled
 *  @retval     false if I2C START generation is disabled
 */
__STATIC_INLINE bool DL_I2C_isStartConditionEnabled(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MCTR & I2C_MCTR_START_MASK) == I2C_MCTR_START_ENABLE);
}

/**
 *  @brief      Enable I2C START generation
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableStartCondition(I2C_Regs *i2c)
{
    i2c->MASTER.MCTR |= I2C_MCTR_START_ENABLE;
}

/**
 *  @brief      Disable I2C STOP generation
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableStopCondition(I2C_Regs *i2c)
{
    i2c->MASTER.MCTR &= ~(I2C_MCTR_STOP_MASK);
}

/**
 *  @brief      Checks if I2C STOP generation is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If I2C STOP generation is enabled
 *
 *  @retval     true if I2C STOP generation is enabled
 *  @retval     false if I2C STOP generation is disabled
 */
__STATIC_INLINE bool DL_I2C_isStopConditionEnabled(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MCTR & I2C_MCTR_STOP_MASK) == I2C_MCTR_STOP_ENABLE);
}

/**
 *  @brief      Enable I2C STOP generation
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableStopCondition(I2C_Regs *i2c)
{
    i2c->MASTER.MCTR |= I2C_MCTR_STOP_ENABLE;
}

/**
 *  @brief      Disable I2C controller data acknowledge (ACK or NACK)
 *
 *  When the I2C module operates in Controller receiver mode, the ACK bit can be
 *  cleared when no further data needs to be received from the target
 *  transmitter.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableControllerACK(I2C_Regs *i2c)
{
    i2c->MASTER.MCTR &= ~(I2C_MCTR_ACK_MASK);
}

/**
 *  @brief      Checks if I2C controller data acknowledge (ACK or NACK) is
 *              enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If I2C controller data acknowledge is enabled
 *
 *  @retval     true if I2C controller data acknowledge is enabled
 *  @retval     false if I2C controller data acknowledge is disabled
 */
__STATIC_INLINE bool DL_I2C_isControllerACKEnabled(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MCTR & I2C_MCTR_ACK_MASK) == I2C_MCTR_ACK_ENABLE);
}

/**
 *  @brief      Enable I2C controller data acknowledge (ACK or NACK)
 *
 *  When the I2C module operates in Controller receiver mode, the ACK bit is
 *  normally set causing the I2C bus controller to transmit an acknowledge
 *  automatically after each byte.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableControllerACK(I2C_Regs *i2c)
{
    i2c->MASTER.MCTR |= I2C_MCTR_ACK_MASK;
}

/**
 *  @brief      Get transaction length in bytes
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     Length of I2C transaction in bytes
 *
 *  @retval     [0x000, 0xfff]
 */
__STATIC_INLINE uint32_t DL_I2C_getTransactionLength(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MCTR & I2C_MCTR_MBLEN_MASK) >> I2C_MCTR_MBLEN_OFS);
}

/**
 *  @brief      Set transaction length in bytes
 *
 *  @param[in]  i2c         Pointer to the register overlay for the peripheral
 *
 *  @param[in]  length      Length of I2C transaction in bytes [0x000, 0xfff]
 */
__STATIC_INLINE void DL_I2C_setTransactionLength(
    I2C_Regs *i2c, uint32_t length)
{
    DL_Common_updateReg(&i2c->MASTER.MCTR, (length << I2C_MCTR_MBLEN_OFS),
        I2C_MCTR_MBLEN_MASK);
}

/**
 *  @brief      Get status of I2C bus controller for controller
 *
 *  @param[in]  i2c         Pointer to the register overlay for the peripheral
 *
 *  @return     Status of I2C bus controller for controller
 *
 *  @retval     Bitwise OR of @ref DL_I2C_CONTROLLER_STATUS
 */
__STATIC_INLINE uint32_t DL_I2C_getControllerStatus(I2C_Regs *i2c)
{
    return (i2c->MASTER.MSR);
}

/**
 *  @brief      Get transaction count in bytes
 *
 *  @param[in]  i2c         Pointer to the register overlay for the peripheral
 *
 *  @return     Current 12-bit countdown value of the transaction
 *
 *  @retval     [0x000, 0xfff]
 */
__STATIC_INLINE uint16_t DL_I2C_getTransactionCount(I2C_Regs *i2c)
{
    return ((uint16_t)(
        (i2c->MASTER.MSR & I2C_MSR_MBCNT_MASK) >> I2C_MSR_MBCNT_OFS));
}

/**
 *  @brief      Get byte of data from I2C controller
 *
 *  If using FIFO, it is first byte from the RX FIFO.
 *
 *  @param[in]  i2c         Pointer to the register overlay for the peripheral
 *
 *  @return     Last received byte of data
 *
 *  @retval     [0x00, 0xff]
 */
__STATIC_INLINE uint8_t DL_I2C_receiveControllerData(I2C_Regs *i2c)
{
    return ((uint8_t)(i2c->MASTER.MRXDATA & I2C_MRXDATA_VALUE_MASK));
}

/**
 *  @brief      Set next byte to be transferred during the next transaction
 *
 *  Does not transmit data until @ref DL_I2C_startControllerTransfer
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  data    Data to be transferred during the next transaction.
 *                      [0x00, 0xff]
 */
__STATIC_INLINE void DL_I2C_transmitControllerData(I2C_Regs *i2c, uint8_t data)
{
    i2c->MASTER.MTXDATA = data;
}

/**
 *  @brief      Get timer period
 *  This field is used in the equation to configure SCL_PERIOD:
 *
 *  SCL_PERIOD = (1 + TPR) * (SCL_LP + SCL_HP) * INT_CLK_PRD
 *
 *  where:
 *  SCL_PRD is the SCL line period (I2C clock)
 *
 *  TPR is the Timer Period register value (range of 1 to 127)
 *
 *  SCL_LP is the SCL Low period (fixed at 6)
 *  SCL_HP is the SCL High period (fixed at 4)
 *
 *  CLK_PRD is the functional clock period in ns
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @return     Timer period
 *
 *  @retval     [0x00, 0x7f]
 */
__STATIC_INLINE uint8_t DL_I2C_getTimerPeriod(I2C_Regs *i2c)
{
    return ((uint8_t)(i2c->MASTER.MTPR & I2C_MTPR_TPR_MASK));
}

/**
 *  @brief      Set timer period
 *  This field is used in the equation to configure SCL_PERIOD:
 *
 *  SCL_PERIOD = (1 + TPR) * (SCL_LP + SCL_HP) * INT_CLK_PRD
 *
 *  where:
 *  SCL_PRD is the SCL line period (I2C clock)
 *
 *  TPR is the Timer Period register value (range of 1 to 127)
 *
 *  SCL_LP is the SCL Low period (fixed at 6)
 *  SCL_HP is the SCL High period (fixed at 4)
 *
 *  CLK_PRD is the functional clock period in ns
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  period  Timer period [0x00, 0x7f]
 */
__STATIC_INLINE void DL_I2C_setTimerPeriod(I2C_Regs *i2c, uint8_t period)
{
    i2c->MASTER.MTPR = period;
}

/**
 *  @brief      Disable loopback mode
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableLoopbackMode(I2C_Regs *i2c)
{
    i2c->MASTER.MCR &= ~(I2C_MCR_LPBK_MASK);
}

/**
 *  @brief      Checks if loopback mode is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If loopback mode is enabled
 *
 *  @retval     true if loopback mode is enabled
 *  @retval     false if loopback mode is disabled
 */
__STATIC_INLINE bool DL_I2C_isLoopbackModeEnabled(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MCR & I2C_MCR_LPBK_MASK) == I2C_MCR_LPBK_ENABLE);
}

/**
 *  @brief      Enable loopback mode
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableLoopbackMode(I2C_Regs *i2c)
{
    i2c->MASTER.MCR |= I2C_MCR_LPBK_ENABLE;
}

/**
 *  @brief      Disable multicontroller mode
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableMultiControllerMode(I2C_Regs *i2c)
{
    i2c->MASTER.MCR &= ~(I2C_MCR_MMST_MASK);
}

/**
 *  @brief      Checks if multicontroller mode is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If multicontroller mode is enabled
 *
 *  @retval     true if multicontroller mode is enabled
 *  @retval     false if multicontroller mode is disabled
 */
__STATIC_INLINE bool DL_I2C_isMultiControllerModeEnabled(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MCR & I2C_MCR_MMST_MASK) == I2C_MCR_MMST_ENABLE);
}

/**
 *  @brief      Enable multicontroller mode
 *
 *  In multicontroller mode, the SCL high time counts once the SCL line has been
 *  detected high. If this is not enabled, the high time counts as soon as the
 *  SCL line has been set high by the I2C controller
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableMultiControllerMode(I2C_Regs *i2c)
{
    i2c->MASTER.MCR |= I2C_MCR_MMST_ENABLE;
}

/**
 *  @brief      Disable controller
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableController(I2C_Regs *i2c)
{
    i2c->MASTER.MCR &= ~(I2C_MCR_ACTIVE_MASK);
}

/**
 *  @brief      Checks if controller is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If controller is enabled
 *
 *  @retval     true if controller is enabled
 *  @retval     false if controller is disabled
 */
__STATIC_INLINE bool DL_I2C_isControllerEnabled(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MCR & I2C_MCR_ACTIVE_MASK) == I2C_MCR_ACTIVE_ENABLE);
}

/**
 *  @brief      Enable controller
 *
 *  After controller has enabled, it should not be re-enabled unless it has been
 *  disabled or by a reset, otherwise transfer failures may occur.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableController(I2C_Regs *i2c)
{
    i2c->MASTER.MCR |= I2C_MCR_ACTIVE_ENABLE;
}

/**
 *  @brief      Disable controller clock stretching
 *
 *  Clock stretching can be disabled if no target on the bus supports clock
 *  stretching; however, it should be typically enabled to be compliant with
 *  I2C specification.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableControllerClockStretching(I2C_Regs *i2c)
{
    i2c->MASTER.MCR &= ~(I2C_MCR_CLKSTRETCH_MASK);
}

/**
 *  @brief      Checks if controller clock stretching is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If controller clock stretching is enabled
 *
 *  @retval     true if controller clock stretching is enabled
 *  @retval     false if controller clock stretching is disabled
 */
__STATIC_INLINE bool DL_I2C_isControllerClockStretchingEnabled(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MCR & I2C_MCR_CLKSTRETCH_MASK) ==
            I2C_MCR_CLKSTRETCH_ENABLE);
}

/**
 *  @brief      Enable controller clock stretching
 *
 *  Clock stretching can be disabled if no target on the bus supports clock
 *  stretching; however, it should be typically enabled to be compliant with I2C
 *  specification.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableControllerClockStretching(I2C_Regs *i2c)
{
    i2c->MASTER.MCR |= I2C_MCR_CLKSTRETCH_ENABLE;
}

/**
 *  @brief      Get SCL signal status
 *
 *  @param[in]  i2c         Pointer to the register overlay for the peripheral
 *
 *  @return     Status of SCL signal
 *
 *  @retval     One of @ref DL_I2C_CONTROLLER_SCL
 */
__STATIC_INLINE DL_I2C_CONTROLLER_SCL DL_I2C_getSCLStatus(I2C_Regs *i2c)
{
    uint32_t sclStatus = i2c->MASTER.MBMON & I2C_MBMON_SCL_MASK;

